src/cf/Enums/ФункцииУчастниковСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласующий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбеспечивающийСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготавливающийОбработкуРезультата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготавливающийЗавершение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/РезультатыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РезультатыСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованоСЗамечаниями</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковПодписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковПодписания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подписывающий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбеспечивающийПодписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/РезультатыПодписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РезультатыПодписания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодписано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Регистратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/РезультатыРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РезультатыРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗарегистрировано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковУтверждения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковУтверждения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Утверждающий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/РезультатыУтверждения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РезультатыУтверждения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Утверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУтверждено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковИсполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковИсполнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезолюцию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривающий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоопределениеФункцииУчастника</Name>
					<Comment>Автоопределение функции участника (рассмотрение/исполнение)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/РезультатыИсполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РезультатыИсполнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исполнено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonForms/ВыполнениеСтрокиДействия/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Действие = Параметры.Действие;
	Участник = Параметры.Участник;
	ФункцияУчастника = Параметры.Функция;
	Идентификатор = Параметры.Идентификатор;
	
	Элементы.Комментарий.Видимость = Ложь;
	Элементы.ВыполнитьДействиеЗадачиВариант1.Видимость = Ложь;
	Элементы.ВыполнитьДействиеЗадачиВариант2.Видимость = Ложь;
	Элементы.ВыполнитьДействиеЗадачиВариант3.Видимость = Ложь;
	
	Если ДействияКлиентСервер.ЭтоДействиеСогласования(Действие) Тогда
		
		Если ФункцияУчастника = Перечисления.ФункцииУчастниковСогласования.Согласующий Тогда
			
			Элементы.Комментарий.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант1.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант2.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант3.Видимость = Истина;
			
			Элементы.ВыполнитьДействиеЗадачиВариант1.Заголовок = НСтр("ru = 'Согласовано'");
			РезультатыКнопок.Добавить(Перечисления.РезультатыСогласования.Согласовано);
			Элементы.ВыполнитьДействиеЗадачиВариант1.ЦветТекста = ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Ложь);
			
			Элементы.ВыполнитьДействиеЗадачиВариант2.Заголовок = НСтр("ru = 'Согласовано с замечаниями'");
			РезультатыКнопок.Добавить(Перечисления.РезультатыСогласования.СогласованоСЗамечаниями);
			Элементы.ВыполнитьДействиеЗадачиВариант2.ЦветТекста = ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Истина);
			
			Элементы.ВыполнитьДействиеЗадачиВариант3.Заголовок = НСтр("ru = 'Не согласовано'");
			РезультатыКнопок.Добавить(Перечисления.РезультатыСогласования.НеСогласовано);
			Элементы.ВыполнитьДействиеЗадачиВариант3.ЦветТекста = ЦветаСтиля.ОтметкаОтрицательногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Истина);
			
		ИначеЕсли ФункцияУчастника = Перечисления.ФункцииУчастниковСогласования.ОбрабатывающийРезультат Тогда	
			
			Элементы.Комментарий.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант1.Видимость = Истина;
			
			Элементы.ВыполнитьДействиеЗадачиВариант1.Заголовок = НСтр("ru = 'Ознакомился'");
			РезультатыКнопок.Добавить(Неопределено);
			Элементы.ВыполнитьДействиеЗадачиВариант1.ЦветТекста = ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Ложь);
			
		КонецЕсли;	
		
	ИначеЕсли ДействияКлиентСервер.ЭтоДействиеПодписания(Действие) Тогда
		
		Если ФункцияУчастника = Перечисления.ФункцииУчастниковПодписания.Подписывающий Тогда
			
			Элементы.Комментарий.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант1.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант2.Видимость = Истина;
			
			Элементы.ВыполнитьДействиеЗадачиВариант1.Заголовок = НСтр("ru = 'Подписать'");
			РезультатыКнопок.Добавить(Перечисления.РезультатыПодписания.Подписано);
			Элементы.ВыполнитьДействиеЗадачиВариант1.ЦветТекста = ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Ложь);
			
			Элементы.ВыполнитьДействиеЗадачиВариант2.Заголовок = НСтр("ru = 'Отказ'");
			РезультатыКнопок.Добавить(Перечисления.РезультатыПодписания.НеПодписано);
			Элементы.ВыполнитьДействиеЗадачиВариант2.ЦветТекста = ЦветаСтиля.ОтметкаОтрицательногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Истина);
			
		ИначеЕсли ФункцияУчастника = Перечисления.ФункцииУчастниковПодписания.ОбрабатывающийРезультат Тогда	
			
			Элементы.Комментарий.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант1.Видимость = Истина;
			
			Элементы.ВыполнитьДействиеЗадачиВариант1.Заголовок = НСтр("ru = 'Ознакомился'");
			РезультатыКнопок.Добавить(Неопределено);
			Элементы.ВыполнитьДействиеЗадачиВариант1.ЦветТекста = ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Ложь);
			
		КонецЕсли;	
		
	ИначеЕсли ДействияКлиентСервер.ЭтоДействиеРегистрации(Действие) Тогда
		
		Если ФункцияУчастника = Перечисления.ФункцииУчастниковРегистрации.Регистратор Тогда
			
			Элементы.Комментарий.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант1.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант2.Видимость = Истина;
			
			Элементы.ВыполнитьДействиеЗадачиВариант1.Заголовок = НСтр("ru = 'Зарегистрировать'");
			РезультатыКнопок.Добавить(Перечисления.РезультатыРегистрации.Зарегистрировано);
			Элементы.ВыполнитьДействиеЗадачиВариант1.ЦветТекста = ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Ложь);
			
			Элементы.ВыполнитьДействиеЗадачиВариант2.Заголовок = НСтр("ru = 'Не регистрировать'");
			РезультатыКнопок.Добавить(Перечисления.РезультатыРегистрации.НеЗарегистрировано);
			Элементы.ВыполнитьДействиеЗадачиВариант2.ЦветТекста = ЦветаСтиля.ОтметкаОтрицательногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Истина);
			
		ИначеЕсли ФункцияУчастника = Перечисления.ФункцииУчастниковРегистрации.ОбрабатывающийРезультат Тогда	
			
			Элементы.Комментарий.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант1.Видимость = Истина;
			
			Элементы.ВыполнитьДействиеЗадачиВариант1.Заголовок = НСтр("ru = 'Ознакомился'");
			РезультатыКнопок.Добавить(Неопределено);
			Элементы.ВыполнитьДействиеЗадачиВариант1.ЦветТекста = ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Ложь);
			
		КонецЕсли;	
		
	ИначеЕсли ДействияКлиентСервер.ЭтоДействиеУтверждения(Действие) Тогда
		
		Если ФункцияУчастника = Перечисления.ФункцииУчастниковУтверждения.Утверждающий Тогда
			
			Элементы.Комментарий.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант1.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант2.Видимость = Истина;
			
			Элементы.ВыполнитьДействиеЗадачиВариант1.Заголовок = НСтр("ru = 'Утверждено'");
			РезультатыКнопок.Добавить(Перечисления.РезультатыУтверждения.Утверждено);
			Элементы.ВыполнитьДействиеЗадачиВариант1.ЦветТекста = ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Ложь);
			
			Элементы.ВыполнитьДействиеЗадачиВариант2.Заголовок = НСтр("ru = 'Не утверждено'");
			РезультатыКнопок.Добавить(Перечисления.РезультатыУтверждения.НеУтверждено);
			Элементы.ВыполнитьДействиеЗадачиВариант2.ЦветТекста = ЦветаСтиля.ОтметкаОтрицательногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Истина);
			
		ИначеЕсли ФункцияУчастника = Перечисления.ФункцииУчастниковУтверждения.ОбрабатывающийРезультат Тогда	
			
			Элементы.Комментарий.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант1.Видимость = Истина;
			
			Элементы.ВыполнитьДействиеЗадачиВариант1.Заголовок = НСтр("ru = 'Ознакомился'");
			РезультатыКнопок.Добавить(Неопределено);
			Элементы.ВыполнитьДействиеЗадачиВариант1.ЦветТекста = ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Ложь);
			
		КонецЕсли;	
		
	ИначеЕсли ДействияКлиентСервер.ЭтоДействиеИсполнения(Действие) Тогда
		
		Если ФункцияУчастника = Перечисления.ФункцииУчастниковИсполнения.Исполнитель Тогда
			
			Элементы.Комментарий.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант1.Видимость = Истина;
			
			Элементы.ВыполнитьДействиеЗадачиВариант1.Заголовок = НСтр("ru = 'Исполнено'");
			РезультатыКнопок.Добавить(Перечисления.РезультатыИсполнения.Исполнено);
			Элементы.ВыполнитьДействиеЗадачиВариант1.ЦветТекста = ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Ложь);
			
		ИначеЕсли ФункцияУчастника = Перечисления.ФункцииУчастниковИсполнения.Рассматривающий Тогда	
			
			Элементы.Комментарий.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант1.Видимость = Истина;
			Элементы.ВыполнитьДействиеЗадачиВариант2.Видимость = Истина;
			
			Элементы.ВыполнитьДействиеЗадачиВариант1.Заголовок = НСтр("ru = 'Рассмотрено'");
			РезультатыКнопок.Добавить(Перечисления.РезультатыРассмотрения.Рассмотрено);
			Элементы.ВыполнитьДействиеЗадачиВариант1.ЦветТекста = ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Ложь);
			
			Элементы.ВыполнитьДействиеЗадачиВариант2.Заголовок = НСтр("ru = 'Направить помощнику'");
			//РезультатыКнопок.Добавить(Перечисления.РезультатыРассмотрения.НаправитьПомощнику);
			РезультатыКнопок.Добавить(Неопределено);
			Элементы.ВыполнитьДействиеЗадачиВариант2.ЦветТекста = ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи;
			ТребуетсяКомментарий.Добавить(Ложь);
			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьДействиеЗадачиВариант1(Команда)
	
	ВыполнитьДействиеЗадачиНаКлиентеВФорме(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеЗадачиВариант2(Команда)
	
	ВыполнитьДействиеЗадачиНаКлиентеВФорме(2);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеЗадачиВариант3(Команда)
	
	ВыполнитьДействиеЗадачиНаКлиентеВФорме(3);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеЗадачиНаКлиентеВФорме(ВариантВыполнения)
	
	Если ФункцияУчастника = ПредопределенноеЗначение("Перечисление.ФункцииУчастниковИсполнения.Рассматривающий")
		И ВариантВыполнения = 2 Тогда	
		ПоказатьПредупреждение(, НСтр("ru = 'Функция появится позже.'"));
		Возврат;
	КонецЕсли;	
	
	// 1 2 3 - преобразуем чтобы с 0 шло
	ВыбранныйРезультат = РезультатыКнопок[ВариантВыполнения - 1].Значение; 
	НуженКомментарий = ТребуетсяКомментарий[ВариантВыполнения - 1].Значение; 
	
	Если НуженКомментарий И Не ЗначениеЗаполнено(Комментарий) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Введите комментарий.'"));
		Возврат;
	КонецЕсли;	
	
	СтруктураВозврата = Новый Структура("Результат, Комментарий",
		ВыбранныйРезультат, Комментарий);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти
